
export default {
    /**
   * 手机号验证规则
   */
    phoneNumber: /^(?:(?:\+|00)86)?1[3-9]\d{9}$/,

    /**
     * 不匹配中国大陆手机号
     */
    mismatchPhoneNumber: /^(?!(?:(?:\+|00)86)?1[3-9]\d{9}\b).*$/,

    /**
     * 手机号包括座机
     */
    landlineAndPhone: /^(^0\d{2}-?\d{8}$)|(^0\d{3}-?\d{7}$)|(^-?\d{8}$)|(^-?\d{7}$)$/,

    /**
     * 不包含@字符
     */
    mismatchEmail: /^[^@]*$/,

    /**
     * 邮箱验证规则
     */
    email: /^(([^<>()[\]\\.,;:\s@"]+(\.[^<>()[\]\\.,;:\s@"]+)*)|(".+"))@((\[\d{1,3}\.\d{1,3}\.\d{1,3}\.\d{1,3}\])|(([a-z\-0-9]+\.)+[a-z]{2,}))$/i,

    /**
     * 手机号或者邮箱验证规则
     */
    phoneOrEmail: /^(1[3-9]\d{9}|[\w.%+-]+@[a-z0-9.-]+\.[a-z]{2,})$/i,

    /**
     * 身份证号验证规则
     */
    idCard: /^[1-9]\d{5}(?:18|19|20)\d{2}(?:0[1-9]|10|11|12)(?:0[1-9]|[12]\d|30|31)\d{3}[\dX]$/i,

    /**
     * 密码验证规则
     * 密码至少包含8个字符，包含大小写字母，数字，特殊字符
     */
    password: /^(?=.*[a-z])(?=.*[A-Z])(?=.*\d)(?=.*[^a-zA-Z0-9]).{8,}$/,

    /**
     * 签名密码验证规则
     * 密码至少包含4个字符，包含大小写字母，数字，特殊字符
     */
    autographPassword: /^(?=.*[a-z])(?=.*\d)(?=.*[~!@#$%^&*()_+`\-={}:";'<>?,./]).{4,}$/i,

    /**
     * IP 校验规则
     */
    ip: /^(?:(?:25[0-5]|2[0-4]\d|[01]?\d{1,2})\.){3}(?:25[0-5]|2[0-4]\d|[01]?\d{1,2})$/,

    /**
     * 匹配中文字母数字
     */
    zn_letter_number: /^[\u4E00-\u9FA5\w]+$/
}
